Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxRif_bf.h
/** \brief Offset for Ifx_RIF_IPI_Bits.DL */
#define IFX_RIF_IPI_DL_OFF (0u)

/** \brief Length for Ifx_RIF_IPI_Bits.PFP */
#define IFX_RIF_IPI_PFP_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.PFP */
#define IFX_RIF_IPI_PFP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.PFP */
#define IFX_RIF_IPI_PFP_OFF (3u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN0 */
#define IFX_RIF_IPI_EN0_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN0 */
#define IFX_RIF_IPI_EN0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.EN0 */
#define IFX_RIF_IPI_EN0_OFF (16u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN1 */
#define IFX_RIF_IPI_EN1_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN1 */
#define IFX_RIF_IPI_EN1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.EN1 */
#define IFX_RIF_IPI_EN1_OFF (17u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN2 */
#define IFX_RIF_IPI_EN2_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN2 */
#define IFX_RIF_IPI_EN2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.EN2 */
#define IFX_RIF_IPI_EN2_OFF (18u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN3 */
#define IFX_RIF_IPI_EN3_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN3 */
#define IFX_RIF_IPI_EN3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.EN3 */
#define IFX_RIF_IPI_EN3_OFF (19u)

/** \brief Length for Ifx_RIF_IPI_Bits.DBGSEL */
#define IFX_RIF_IPI_DBGSEL_LEN (2u)

/** \brief Mask for Ifx_RIF_IPI_Bits.DBGSEL */
#define IFX_RIF_IPI_DBGSEL_MSK (0x3u)

/** \brief Offset for Ifx_RIF_IPI_Bits.DBGSEL */
#define IFX_RIF_IPI_DBGSEL_OFF (29u)

/** \brief Length for Ifx_RIF_IPI_Bits.SDDV */
#define IFX_RIF_IPI_SDDV_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.SDDV */
#define IFX_RIF_IPI_SDDV_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.SDDV */
#define IFX_RIF_IPI_SDDV_OFF (31u)

/** \brief Length for Ifx_RIF_FLM_Bits.MODE */
#define IFX_RIF_FLM_MODE_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.MODE */
#define IFX_RIF_FLM_MODE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.MODE */
#define IFX_RIF_FLM_MODE_OFF (0u)

/** \brief Length for Ifx_RIF_FLM_Bits.FSWP */
#define IFX_RIF_FLM_FSWP_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.FSWP */
#define IFX_RIF_FLM_FSWP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.FSWP */
#define IFX_RIF_FLM_FSWP_OFF (1u)

/** \brief Length for Ifx_RIF_FLM_Bits.CRCEN */
#define IFX_RIF_FLM_CRCEN_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.CRCEN */
#define IFX_RIF_FLM_CRCEN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.CRCEN */
#define IFX_RIF_FLM_CRCEN_OFF (8u)

/** \brief Length for Ifx_RIF_FLM_Bits.CRCALT */
#define IFX_RIF_FLM_CRCALT_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.CRCALT */
#define IFX_RIF_FLM_CRCALT_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.CRCALT */
#define IFX_RIF_FLM_CRCALT_OFF (9u)

/** \brief Length for Ifx_RIF_FLM_Bits.CRCERIN */
#define IFX_RIF_FLM_CRCERIN_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.CRCERIN */
#define IFX_RIF_FLM_CRCERIN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.CRCERIN */
#define IFX_RIF_FLM_CRCERIN_OFF (10u)

/** \brief Length for Ifx_RIF_FLM_Bits.EXPCRCWO */
#define IFX_RIF_FLM_EXPCRCWO_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.EXPCRCWO */
#define IFX_RIF_FLM_EXPCRCWO_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.EXPCRCWO */
#define IFX_RIF_FLM_EXPCRCWO_OFF (11u)

/** \brief Length for Ifx_RIF_FLM_Bits.CRCBS */
#define IFX_RIF_FLM_CRCBS_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.CRCBS */
#define IFX_RIF_FLM_CRCBS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.CRCBS */
#define IFX_RIF_FLM_CRCBS_OFF (12u)

/** \brief Length for Ifx_RIF_FLM_Bits.REGCRCEN */
#define IFX_RIF_FLM_REGCRCEN_LEN (2u)

/** \brief Mask for Ifx_RIF_FLM_Bits.REGCRCEN */
#define IFX_RIF_FLM_REGCRCEN_MSK (0x3u)

/** \brief Offset for Ifx_RIF_FLM_Bits.REGCRCEN */
#define IFX_RIF_FLM_REGCRCEN_OFF (16u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF0 */
#define IFX_RIF_DMI_ENF0_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF0 */
#define IFX_RIF_DMI_ENF0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF0 */
#define IFX_RIF_DMI_ENF0_OFF (0u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF1 */
#define IFX_RIF_DMI_ENF1_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF1 */
#define IFX_RIF_DMI_ENF1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF1 */
#define IFX_RIF_DMI_ENF1_OFF (1u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF2 */
#define IFX_RIF_DMI_ENF2_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF2 */
#define IFX_RIF_DMI_ENF2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF2 */
#define IFX_RIF_DMI_ENF2_OFF (2u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF3 */
#define IFX_RIF_DMI_ENF3_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF3 */
#define IFX_RIF_DMI_ENF3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF3 */
#define IFX_RIF_DMI_ENF3_OFF (3u)

/** \brief Length for Ifx_RIF_RSM0_Bits.LCKSTP */
#define IFX_RIF_RSM0_LCKSTP_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.LCKSTP */
#define IFX_RIF_RSM0_LCKSTP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM0_Bits.LCKSTP */
#define IFX_RIF_RSM0_LCKSTP_OFF (30u)

/** \brief Length for Ifx_RIF_RSM0_Bits.INTADC */
#define IFX_RIF_RSM0_INTADC_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.INTADC */
#define IFX_RIF_RSM0_INTADC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM0_Bits.INTADC */
#define IFX_RIF_RSM0_INTADC_OFF (31u)

/** \brief Length for Ifx_RIF_RSM1_Bits.RAMPS */
#define IFX_RIF_RSM1_RAMPS_LEN (11u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.RAMPS */
#define IFX_RIF_RSM1_RAMPS_MSK (0x7ffu)

/** \brief Offset for Ifx_RIF_RSM1_Bits.RAMPS */
#define IFX_RIF_RSM1_RAMPS_OFF (0u)

/** \brief Length for Ifx_RIF_RSM1_Bits.RR12 */
#define IFX_RIF_RSM1_RR12_LEN (2u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.RR12 */
#define IFX_RIF_RSM1_RR12_MSK (0x3u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.RR12 */
#define IFX_RIF_RSM1_RR12_OFF (12u)

/** \brief Length for Ifx_RIF_RSM1_Bits.R1SEL */
#define IFX_RIF_RSM1_R1SEL_LEN (2u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.R1SEL */
#define IFX_RIF_RSM1_R1SEL_MSK (0x3u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.R1SEL */
#define IFX_RIF_RSM1_R1SEL_OFF (14u)

/** \brief Length for Ifx_RIF_RSM1_Bits.CURRAMP */
#define IFX_RIF_RSM1_CURRAMP_LEN (12u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.CURRAMP */
#define IFX_RIF_RSM1_CURRAMP_MSK (0xfffu)

/** \brief Offset for Ifx_RIF_RSM1_Bits.CURRAMP */
#define IFX_RIF_RSM1_CURRAMP_OFF (16u)

/** \brief Length for Ifx_RIF_RSM1_Bits.R1POL */
#define IFX_RIF_RSM1_R1POL_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.R1POL */
#define IFX_RIF_RSM1_R1POL_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.R1POL */
#define IFX_RIF_RSM1_R1POL_OFF (29u)

/** \brief Length for Ifx_RIF_RSM1_Bits.RR30 */
#define IFX_RIF_RSM1_RR30_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.RR30 */
#define IFX_RIF_RSM1_RR30_MSK (0x1u)

