Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxRif_bf.h
/** \brief Offset for Ifx_RIF_RSM1_Bits.RR30 */
#define IFX_RIF_RSM1_RR30_OFF (30u)

/** \brief Length for Ifx_RIF_RSM1_Bits.R1EN */
#define IFX_RIF_RSM1_R1EN_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.R1EN */
#define IFX_RIF_RSM1_R1EN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.R1EN */
#define IFX_RIF_RSM1_R1EN_OFF (31u)

/** \brief Length for Ifx_RIF_RSM2_Bits.SAMPLES */
#define IFX_RIF_RSM2_SAMPLES_LEN (11u)

/** \brief Mask for Ifx_RIF_RSM2_Bits.SAMPLES */
#define IFX_RIF_RSM2_SAMPLES_MSK (0x7ffu)

/** \brief Offset for Ifx_RIF_RSM2_Bits.SAMPLES */
#define IFX_RIF_RSM2_SAMPLES_OFF (0u)

/** \brief Length for Ifx_RIF_RSM2_Bits.CURSAMPLE */
#define IFX_RIF_RSM2_CURSAMPLE_LEN (12u)

/** \brief Mask for Ifx_RIF_RSM2_Bits.CURSAMPLE */
#define IFX_RIF_RSM2_CURSAMPLE_MSK (0xfffu)

/** \brief Offset for Ifx_RIF_RSM2_Bits.CURSAMPLE */
#define IFX_RIF_RSM2_CURSAMPLE_OFF (16u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CALE */
#define IFX_RIF_INTCON_CALE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CALE */
#define IFX_RIF_INTCON_CALE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CALE */
#define IFX_RIF_INTCON_CALE_OFF (0u)

/** \brief Length for Ifx_RIF_INTCON_Bits.FWE */
#define IFX_RIF_INTCON_FWE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.FWE */
#define IFX_RIF_INTCON_FWE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.FWE */
#define IFX_RIF_INTCON_FWE_OFF (1u)

/** \brief Length for Ifx_RIF_INTCON_Bits.REE */
#define IFX_RIF_INTCON_REE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.REE */
#define IFX_RIF_INTCON_REE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.REE */
#define IFX_RIF_INTCON_REE_OFF (2u)

/** \brief Length for Ifx_RIF_INTCON_Bits.UEE */
#define IFX_RIF_INTCON_UEE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.UEE */
#define IFX_RIF_INTCON_UEE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.UEE */
#define IFX_RIF_INTCON_UEE_OFF (3u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE0 */
#define IFX_RIF_INTCON_CRCE0_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE0 */
#define IFX_RIF_INTCON_CRCE0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE0 */
#define IFX_RIF_INTCON_CRCE0_OFF (4u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE1 */
#define IFX_RIF_INTCON_CRCE1_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE1 */
#define IFX_RIF_INTCON_CRCE1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE1 */
#define IFX_RIF_INTCON_CRCE1_OFF (5u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE2 */
#define IFX_RIF_INTCON_CRCE2_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE2 */
#define IFX_RIF_INTCON_CRCE2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE2 */
#define IFX_RIF_INTCON_CRCE2_OFF (6u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE3 */
#define IFX_RIF_INTCON_CRCE3_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE3 */
#define IFX_RIF_INTCON_CRCE3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE3 */
#define IFX_RIF_INTCON_CRCE3_OFF (7u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1EE */
#define IFX_RIF_INTCON_R1EE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.R1EE */
#define IFX_RIF_INTCON_R1EE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1EE */
#define IFX_RIF_INTCON_R1EE_OFF (8u)

/** \brief Length for Ifx_RIF_INTCON_Bits.U1EE */
#define IFX_RIF_INTCON_U1EE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.U1EE */
#define IFX_RIF_INTCON_U1EE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.U1EE */
#define IFX_RIF_INTCON_U1EE_OFF (9u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1SE */
#define IFX_RIF_INTCON_R1SE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.R1SE */
#define IFX_RIF_INTCON_R1SE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1SE */
#define IFX_RIF_INTCON_R1SE_OFF (10u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CALF */
#define IFX_RIF_INTCON_CALF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CALF */
#define IFX_RIF_INTCON_CALF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CALF */
#define IFX_RIF_INTCON_CALF_OFF (16u)

/** \brief Length for Ifx_RIF_INTCON_Bits.FWF */
#define IFX_RIF_INTCON_FWF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.FWF */
#define IFX_RIF_INTCON_FWF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.FWF */
#define IFX_RIF_INTCON_FWF_OFF (17u)

/** \brief Length for Ifx_RIF_INTCON_Bits.REF */
#define IFX_RIF_INTCON_REF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.REF */
#define IFX_RIF_INTCON_REF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.REF */
#define IFX_RIF_INTCON_REF_OFF (18u)

/** \brief Length for Ifx_RIF_INTCON_Bits.UEF */
#define IFX_RIF_INTCON_UEF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.UEF */
#define IFX_RIF_INTCON_UEF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.UEF */
#define IFX_RIF_INTCON_UEF_OFF (19u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF0 */
#define IFX_RIF_INTCON_CRCF0_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF0 */
#define IFX_RIF_INTCON_CRCF0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF0 */
#define IFX_RIF_INTCON_CRCF0_OFF (20u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF1 */
#define IFX_RIF_INTCON_CRCF1_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF1 */
#define IFX_RIF_INTCON_CRCF1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF1 */
#define IFX_RIF_INTCON_CRCF1_OFF (21u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF2 */
#define IFX_RIF_INTCON_CRCF2_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF2 */
#define IFX_RIF_INTCON_CRCF2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF2 */
#define IFX_RIF_INTCON_CRCF2_OFF (22u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF3 */
#define IFX_RIF_INTCON_CRCF3_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF3 */
#define IFX_RIF_INTCON_CRCF3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF3 */
#define IFX_RIF_INTCON_CRCF3_OFF (23u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1EF */
#define IFX_RIF_INTCON_R1EF_LEN (1u)

