Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxRif_bf.h
/** \brief Mask for Ifx_RIF_INTCON_Bits.R1EF */
#define IFX_RIF_INTCON_R1EF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1EF */
#define IFX_RIF_INTCON_R1EF_OFF (24u)

/** \brief Length for Ifx_RIF_INTCON_Bits.U1EF */
#define IFX_RIF_INTCON_U1EF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.U1EF */
#define IFX_RIF_INTCON_U1EF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.U1EF */
#define IFX_RIF_INTCON_U1EF_OFF (25u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1SF */
#define IFX_RIF_INTCON_R1SF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.R1SF */
#define IFX_RIF_INTCON_R1SF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1SF */
#define IFX_RIF_INTCON_R1SF_OFF (26u)

/** \brief Length for Ifx_RIF_INTCON_Bits.SMCF */
#define IFX_RIF_INTCON_SMCF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.SMCF */
#define IFX_RIF_INTCON_SMCF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.SMCF */
#define IFX_RIF_INTCON_SMCF_OFF (29u)

/** \brief Length for Ifx_RIF_INTCON_Bits.REGCRCF */
#define IFX_RIF_INTCON_REGCRCF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.REGCRCF */
#define IFX_RIF_INTCON_REGCRCF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.REGCRCF */
#define IFX_RIF_INTCON_REGCRCF_OFF (30u)

/** \brief Length for Ifx_RIF_INTCON_Bits.LOCKIF */
#define IFX_RIF_INTCON_LOCKIF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.LOCKIF */
#define IFX_RIF_INTCON_LOCKIF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.LOCKIF */
#define IFX_RIF_INTCON_LOCKIF_OFF (31u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CALS */
#define IFX_RIF_FLAGSSET_CALS_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CALS */
#define IFX_RIF_FLAGSSET_CALS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CALS */
#define IFX_RIF_FLAGSSET_CALS_OFF (16u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.FWS */
#define IFX_RIF_FLAGSSET_FWS_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.FWS */
#define IFX_RIF_FLAGSSET_FWS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.FWS */
#define IFX_RIF_FLAGSSET_FWS_OFF (17u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.RES */
#define IFX_RIF_FLAGSSET_RES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.RES */
#define IFX_RIF_FLAGSSET_RES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.RES */
#define IFX_RIF_FLAGSSET_RES_OFF (18u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.UES */
#define IFX_RIF_FLAGSSET_UES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.UES */
#define IFX_RIF_FLAGSSET_UES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.UES */
#define IFX_RIF_FLAGSSET_UES_OFF (19u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS0 */
#define IFX_RIF_FLAGSSET_CRCS0_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS0 */
#define IFX_RIF_FLAGSSET_CRCS0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS0 */
#define IFX_RIF_FLAGSSET_CRCS0_OFF (20u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS1 */
#define IFX_RIF_FLAGSSET_CRCS1_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS1 */
#define IFX_RIF_FLAGSSET_CRCS1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS1 */
#define IFX_RIF_FLAGSSET_CRCS1_OFF (21u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS2 */
#define IFX_RIF_FLAGSSET_CRCS2_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS2 */
#define IFX_RIF_FLAGSSET_CRCS2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS2 */
#define IFX_RIF_FLAGSSET_CRCS2_OFF (22u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS3 */
#define IFX_RIF_FLAGSSET_CRCS3_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS3 */
#define IFX_RIF_FLAGSSET_CRCS3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS3 */
#define IFX_RIF_FLAGSSET_CRCS3_OFF (23u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.R1ES */
#define IFX_RIF_FLAGSSET_R1ES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.R1ES */
#define IFX_RIF_FLAGSSET_R1ES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.R1ES */
#define IFX_RIF_FLAGSSET_R1ES_OFF (24u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.U1ES */
#define IFX_RIF_FLAGSSET_U1ES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.U1ES */
#define IFX_RIF_FLAGSSET_U1ES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.U1ES */
#define IFX_RIF_FLAGSSET_U1ES_OFF (25u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.R1SS */
#define IFX_RIF_FLAGSSET_R1SS_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.R1SS */
#define IFX_RIF_FLAGSSET_R1SS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.R1SS */
#define IFX_RIF_FLAGSSET_R1SS_OFF (26u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CALC */
#define IFX_RIF_FLAGSCL_CALC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CALC */
#define IFX_RIF_FLAGSCL_CALC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CALC */
#define IFX_RIF_FLAGSCL_CALC_OFF (16u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_OFF (17u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_OFF (18u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_OFF (20u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_OFF (21u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_LEN (1u)

