Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxRif_bf.h
/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_OFF (22u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_OFF (23u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_OFF (24u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.U1EC */
#define IFX_RIF_FLAGSCL_U1EC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.U1EC */
#define IFX_RIF_FLAGSCL_U1EC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.U1EC */
#define IFX_RIF_FLAGSCL_U1EC_OFF (25u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_OFF (26u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.SMCC */
#define IFX_RIF_FLAGSCL_SMCC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.SMCC */
#define IFX_RIF_FLAGSCL_SMCC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.SMCC */
#define IFX_RIF_FLAGSCL_SMCC_OFF (29u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.REGCRCC */
#define IFX_RIF_FLAGSCL_REGCRCC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.REGCRCC */
#define IFX_RIF_FLAGSCL_REGCRCC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.REGCRCC */
#define IFX_RIF_FLAGSCL_REGCRCC_OFF (30u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.LOCKIC */
#define IFX_RIF_FLAGSCL_LOCKIC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.LOCKIC */
#define IFX_RIF_FLAGSCL_LOCKIC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.LOCKIC */
#define IFX_RIF_FLAGSCL_LOCKIC_OFF (31u)

/** \brief Length for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_LEN (10u)

/** \brief Mask for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_MSK (0x3ffu)

/** \brief Offset for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_OFF (0u)

/** \brief Length for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_OFF (0u)

/** \brief Length for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_OFF (1u)

/** \brief Length for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_OFF (2u)

/** \brief Length for Ifx_RIF_SRIFOVRCFG_Bits.SKMR */
#define IFX_RIF_SRIFOVRCFG_SKMR_LEN (2u)

/** \brief Mask for Ifx_RIF_SRIFOVRCFG_Bits.SKMR */
#define IFX_RIF_SRIFOVRCFG_SKMR_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SRIFOVRCFG_Bits.SKMR */
#define IFX_RIF_SRIFOVRCFG_SKMR_OFF (0u)

/** \brief Length for Ifx_RIF_RSM2CAP_Bits.ENDSAMPLE */
#define IFX_RIF_RSM2CAP_ENDSAMPLE_LEN (12u)

/** \brief Mask for Ifx_RIF_RSM2CAP_Bits.ENDSAMPLE */
#define IFX_RIF_RSM2CAP_ENDSAMPLE_MSK (0xfffu)

/** \brief Offset for Ifx_RIF_RSM2CAP_Bits.ENDSAMPLE */
#define IFX_RIF_RSM2CAP_ENDSAMPLE_OFF (16u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.VALUE */
#define IFX_RIF_SKEWCAL_VALUE_LEN (8u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.VALUE */
#define IFX_RIF_SKEWCAL_VALUE_MSK (0xffu)

/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.VALUE */
#define IFX_RIF_SKEWCAL_VALUE_OFF (0u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.ACCP */
#define IFX_RIF_SKEWCAL_ACCP_LEN (2u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.ACCP */
#define IFX_RIF_SKEWCAL_ACCP_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.ACCP */
#define IFX_RIF_SKEWCAL_ACCP_OFF (8u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.ACCN */
#define IFX_RIF_SKEWCAL_ACCN_LEN (2u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.ACCN */
#define IFX_RIF_SKEWCAL_ACCN_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.ACCN */
#define IFX_RIF_SKEWCAL_ACCN_OFF (10u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.CALRESULT */
#define IFX_RIF_SKEWCAL_CALRESULT_LEN (8u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.CALRESULT */
#define IFX_RIF_SKEWCAL_CALRESULT_MSK (0xffu)

/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.CALRESULT */
#define IFX_RIF_SKEWCAL_CALRESULT_OFF (16u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.FRAME */
#define IFX_RIF_LVDSCON0_FRAME_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.FRAME */
#define IFX_RIF_LVDSCON0_FRAME_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.FRAME */
#define IFX_RIF_LVDSCON0_FRAME_OFF (0u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.CLK */
#define IFX_RIF_LVDSCON0_CLK_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.CLK */
#define IFX_RIF_LVDSCON0_CLK_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.CLK */
#define IFX_RIF_LVDSCON0_CLK_OFF (8u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.DATA0 */
#define IFX_RIF_LVDSCON0_DATA0_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.DATA0 */
#define IFX_RIF_LVDSCON0_DATA0_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.DATA0 */
#define IFX_RIF_LVDSCON0_DATA0_OFF (16u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.DATA1 */
#define IFX_RIF_LVDSCON0_DATA1_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.DATA1 */
#define IFX_RIF_LVDSCON0_DATA1_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.DATA1 */
#define IFX_RIF_LVDSCON0_DATA1_OFF (24u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.DATA2 */
#define IFX_RIF_LVDSCON1_DATA2_LEN (8u)

