Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxRif_bf.h
/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.DATA2 */
#define IFX_RIF_LVDSCON1_DATA2_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.DATA2 */
#define IFX_RIF_LVDSCON1_DATA2_OFF (0u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.DATA3 */
#define IFX_RIF_LVDSCON1_DATA3_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.DATA3 */
#define IFX_RIF_LVDSCON1_DATA3_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.DATA3 */
#define IFX_RIF_LVDSCON1_DATA3_OFF (8u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.MISC */
#define IFX_RIF_LVDSCON1_MISC_LEN (3u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.MISC */
#define IFX_RIF_LVDSCON1_MISC_MSK (0x7u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.MISC */
#define IFX_RIF_LVDSCON1_MISC_OFF (16u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.RTERM */
#define IFX_RIF_LVDSCON1_RTERM_LEN (3u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.RTERM */
#define IFX_RIF_LVDSCON1_RTERM_MSK (0x7u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.RTERM */
#define IFX_RIF_LVDSCON1_RTERM_OFF (19u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.PWRDN */
#define IFX_RIF_LVDSCON1_PWRDN_LEN (1u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.PWRDN */
#define IFX_RIF_LVDSCON1_PWRDN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.PWRDN */
#define IFX_RIF_LVDSCON1_PWRDN_OFF (24u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.LVDS5VEN */
#define IFX_RIF_LVDSCON1_LVDS5VEN_LEN (1u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.LVDS5VEN */
#define IFX_RIF_LVDSCON1_LVDS5VEN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.LVDS5VEN */
#define IFX_RIF_LVDSCON1_LVDS5VEN_OFF (25u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.FDLY0 */
#define IFX_RIF_DBGDLY0_FDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.FDLY0 */
#define IFX_RIF_DBGDLY0_FDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.FDLY0 */
#define IFX_RIF_DBGDLY0_FDLY0_OFF (0u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.CDLY0 */
#define IFX_RIF_DBGDLY0_CDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.CDLY0 */
#define IFX_RIF_DBGDLY0_CDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.CDLY0 */
#define IFX_RIF_DBGDLY0_CDLY0_OFF (4u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.DDLY0 */
#define IFX_RIF_DBGDLY0_DDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.DDLY0 */
#define IFX_RIF_DBGDLY0_DDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.DDLY0 */
#define IFX_RIF_DBGDLY0_DDLY0_OFF (8u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.FDLY1 */
#define IFX_RIF_DBGDLY0_FDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.FDLY1 */
#define IFX_RIF_DBGDLY0_FDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.FDLY1 */
#define IFX_RIF_DBGDLY0_FDLY1_OFF (12u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.CDLY1 */
#define IFX_RIF_DBGDLY0_CDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.CDLY1 */
#define IFX_RIF_DBGDLY0_CDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.CDLY1 */
#define IFX_RIF_DBGDLY0_CDLY1_OFF (16u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.DDLY1 */
#define IFX_RIF_DBGDLY0_DDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.DDLY1 */
#define IFX_RIF_DBGDLY0_DDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.DDLY1 */
#define IFX_RIF_DBGDLY0_DDLY1_OFF (20u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.FDLY2 */
#define IFX_RIF_DBGDLY1_FDLY2_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.FDLY2 */
#define IFX_RIF_DBGDLY1_FDLY2_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.FDLY2 */
#define IFX_RIF_DBGDLY1_FDLY2_OFF (0u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.CDLY2 */
#define IFX_RIF_DBGDLY1_CDLY2_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.CDLY2 */
#define IFX_RIF_DBGDLY1_CDLY2_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.CDLY2 */
#define IFX_RIF_DBGDLY1_CDLY2_OFF (4u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.DDLY2 */
#define IFX_RIF_DBGDLY1_DDLY2_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.DDLY2 */
#define IFX_RIF_DBGDLY1_DDLY2_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.DDLY2 */
#define IFX_RIF_DBGDLY1_DDLY2_OFF (8u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.FDLY3 */
#define IFX_RIF_DBGDLY1_FDLY3_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.FDLY3 */
#define IFX_RIF_DBGDLY1_FDLY3_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.FDLY3 */
#define IFX_RIF_DBGDLY1_FDLY3_OFF (12u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.CDLY3 */
#define IFX_RIF_DBGDLY1_CDLY3_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.CDLY3 */
#define IFX_RIF_DBGDLY1_CDLY3_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.CDLY3 */
#define IFX_RIF_DBGDLY1_CDLY3_OFF (16u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.DDLY3 */
#define IFX_RIF_DBGDLY1_DDLY3_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.DDLY3 */
#define IFX_RIF_DBGDLY1_DDLY3_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.DDLY3 */
#define IFX_RIF_DBGDLY1_DDLY3_OFF (20u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.BMDLY0 */
#define IFX_RIF_DBGDLY1_BMDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.BMDLY0 */
#define IFX_RIF_DBGDLY1_BMDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.BMDLY0 */
#define IFX_RIF_DBGDLY1_BMDLY0_OFF (24u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.BMDLY1 */
#define IFX_RIF_DBGDLY1_BMDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.BMDLY1 */
#define IFX_RIF_DBGDLY1_BMDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.BMDLY1 */
#define IFX_RIF_DBGDLY1_BMDLY1_OFF (28u)

/** \brief Length for Ifx_RIF_DBG0_Bits.DD1 */
#define IFX_RIF_DBG0_DD1_LEN (16u)

/** \brief Mask for Ifx_RIF_DBG0_Bits.DD1 */
#define IFX_RIF_DBG0_DD1_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG0_Bits.DD1 */
#define IFX_RIF_DBG0_DD1_OFF (0u)

/** \brief Length for Ifx_RIF_DBG0_Bits.DD2 */
#define IFX_RIF_DBG0_DD2_LEN (16u)

/** \brief Mask for Ifx_RIF_DBG0_Bits.DD2 */
#define IFX_RIF_DBG0_DD2_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG0_Bits.DD2 */
#define IFX_RIF_DBG0_DD2_OFF (16u)

/** \brief Length for Ifx_RIF_DBG1_Bits.DD3 */
#define IFX_RIF_DBG1_DD3_LEN (16u)

